app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "fund", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "h"], ["username", "testing"], ["password_digest", "[FILTERED]"], ["fund", 100.0], ["created_at", "2023-07-23 21:10:04.181076"], ["updated_at", "2023-07-23 21:10:04.181076"]]
---
    def create

        user = User.create!(user_params)